_posts/2013-01-19-Using-units-in-python.html
---
title: Using units in python
date: 2013/01/19 09:00:00
updated: 2013/03/23 09:45:20
categories: python, units
tags: 
---


<p>
<a href="http://matlab.cheme.cmu.edu/2011/08/05/using-cmu-units-in-matlab-for-basic-calculations/" >Units in Matlab</a>
</p>

<p>
I think an essential feature in an engineering computational environment is properly handling units and unit conversions. Mathcad supports that pretty well. I wrote a <a href="https://github.com/jkitchin/matlab-cmu" >package</a> for doing it in Matlab. Today I am going to explore units in python. Here are some of the packages that I have found which support units to some extent
</p>

<ol>
<li><a href="http://pypi.python.org/pypi/units/" >http://pypi.python.org/pypi/units/</a>
</li>
<li><a href="http://packages.python.org/quantities/user/tutorial.html" >http://packages.python.org/quantities/user/tutorial.html</a>
</li>
<li><a href="http://dirac.cnrs-orleans.fr/ScientificPython/ScientificPythonManual/Scientific.Physics.PhysicalQuantities-module.html" >http://dirac.cnrs-orleans.fr/ScientificPython/ScientificPythonManual/Scientific.Physics.PhysicalQuantities-module.html</a>
</li>
<li><a href="http://home.scarlet.be/be052320/Unum.html" >http://home.scarlet.be/be052320/Unum.html</a>
</li>
<li><a href="https://simtk.org/home/python_units" >https://simtk.org/home/python_units</a>
</li>
<li><a href="http://docs.enthought.com/scimath/units/intro.html" >http://docs.enthought.com/scimath/units/intro.html</a>
</li>
</ol>

<p>
The last one looks most promising.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np
<span style="color: #8b0000;">from</span> scimath.units.volume <span style="color: #8b0000;">import</span> liter
<span style="color: #8b0000;">from</span> scimath.units.substance <span style="color: #8b0000;">import</span> mol

q = np.array([1, 2, 3]) * mol
<span style="color: #8b0000;">print</span> q

P = q / liter
<span style="color: #8b0000;">print</span> P
</pre>
</div>

<pre class="example">
[1.0*mol 2.0*mol 3.0*mol]
[1000.0*m**-3*mol 2000.0*m**-3*mol 3000.0*m**-3*mol]
</pre>

<p>
That doesn't look too bad. It is a little clunky to have to import every unit, and it is clear the package is saving everything in SI units by default. Let us try to solve an equation.
</p>

<p>
Find the time that solves this equation. 
</p>

<p>
\(0.01 = C_{A0} e^{-kt}\)
</p>

<p>
First we solve without units. That way we know the answer.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np
<span style="color: #8b0000;">from</span> scipy.optimize <span style="color: #8b0000;">import</span> fsolve

CA0 = 1.0  <span style="color: #ff0000; font-weight: bold;"># mol/L</span>
CA = 0.01  <span style="color: #ff0000; font-weight: bold;"># mol/L</span>
k = 1.0    <span style="color: #ff0000; font-weight: bold;"># 1/s</span>

<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">func</span>(t):
    z = CA - CA0 * np.exp(-k*t)
    <span style="color: #8b0000;">return</span> z

t0 = 2.3

t, = fsolve(func, t0)
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'t = {0:1.2f} seconds'</span>.format(t)
</pre>
</div>

<pre class="example">
t = 4.61 seconds
</pre>


<p>
Now, with units. I note here that I tried the obvious thing of just importing the units, and adding them on, but the package is unable to work with floats that have units. For some functions, there must be an ndarray with units which is practically what the UnitScalar code below does. 
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np
<span style="color: #8b0000;">from</span> scipy.optimize <span style="color: #8b0000;">import</span> fsolve
<span style="color: #8b0000;">from</span> scimath.units.volume <span style="color: #8b0000;">import</span> liter
<span style="color: #8b0000;">from</span> scimath.units.substance <span style="color: #8b0000;">import</span> mol
<span style="color: #8b0000;">from</span> scimath.units.time <span style="color: #8b0000;">import</span> second
<span style="color: #8b0000;">from</span> scimath.units.api <span style="color: #8b0000;">import</span> has_units, UnitScalar

CA0 = UnitScalar(1.0, units = mol / liter)
CA = UnitScalar(0.01, units = mol / liter)
k = UnitScalar(1.0, units = 1 / second)

<span style="color: #8b0000;">@has_units</span>(inputs=<span style="color: #228b22;">"t::units=s"</span>,
           outputs=<span style="color: #228b22;">"result::units=mol/liter"</span>)
<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">func</span>(t):
    z = CA - CA0 * <span style="color: #8b0000;">float</span>(np.exp(-k*t))
    <span style="color: #8b0000;">return</span> z

t0 = UnitScalar(2.3, units = second)

t, = fsolve(func, t0)
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'t = {0:1.2f} seconds'</span>.format(t)
<span style="color: #8b0000;">print</span> type(t)
</pre>
</div>

<pre class="example">
t = 4.61 seconds
&lt;type 'numpy.float64'&gt;
</pre>

<p>
This is some heavy syntax that in the end does not preserve the units. In my Matlab package, we had to &ldquo;wrap&rdquo; many functions like fsolve so they would preserve units. Clearly this package will need that as well. Overall, in its current implementation this package does not do what I would expect all the time.<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/01/19/Using-units-in-python.org">org-mode source</a><p>